spec/sem4r/report_definition/fixtures/mutate_add-req_orig.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header>
        <n1:RequestHeader env:mustUnderstand="0"
            xmlns:n1="https://adwords.google.com/api/adwords/cm/v201003">
          <n1:authToken></n1:authToken>
          <n1:userAgent></n1:userAgent>
          <n1:developerToken></n1:developerToken>
          <n1:clientEmail></n1:clientEmail>
        </n1:RequestHeader>
  </env:Header>
  <env:Body>
    <n2:mutate xmlns:n2="https://adwords.google.com/api/adwords/cm/v201003">
      <n2:operations xsi:type="n2:ReportDefinitionOperation">
        <n2:operator>ADD</n2:operator>
        <n2:operand>
          <n2:selector>
            <n2:fields>AdGroupId</n2:fields>
            <n2:fields>Id</n2:fields>
            <n2:fields>KeywordText</n2:fields>
            <n2:fields>KeywordMatchType</n2:fields>
            <n2:fields>Impressions</n2:fields>
            <n2:fields>Clicks</n2:fields>
            <n2:fields>Cost</n2:fields>
            <n2:predicates>
              <n2:field>AdGroupId</n2:field>
              <n2:operator>EQUALS</n2:operator>
              <n2:values>0</n2:values>
            </n2:predicates>
            <n2:dateRange>
              <n2:min>INSERT_START_DATE_HERE</n2:min>
              <n2:max>INSERT_END_DATE_HERE</n2:max>
            </n2:dateRange>
          </n2:selector>
          <n2:reportName>Keywords performance report #1277024503235</n2:reportName>
          <n2:reportType>KEYWORDS_PERFORMANCE_REPORT</n2:reportType>
          <n2:dateRangeType>CUSTOM_DATE</n2:dateRangeType>
          <n2:downloadFormat>XML</n2:downloadFormat>
        </n2:operand>
      </n2:operations>
    </n2:mutate>
  </env:Body>
</env:Envelope>
